benchmarks/results/2026-08-29-709-diagnosis/netem-rtt-injection/wrk-crossmachine-netem20ms-off.txt
Running 10s test @ http://192.168.86.37:8069/proxy/health
  4 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    20.56ms  374.41us  30.17ms   97.46%
    Req/Sec   386.21     23.18   404.00     93.25%
  Latency Distribution
     50%   20.53ms
     75%   20.62ms
     90%   20.74ms
     99%   21.19ms
  15391 requests in 10.04s, 8.32MB read
Requests/sec:   1533.38
Transfer/sec:    848.99KB