benchmarks/results/2026-08-29-709-diagnosis/netem-rtt-injection/wrk-crossmachine-netem5ms-off.txt
Running 10s test @ http://192.168.86.37:8069/proxy/health
  4 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.78ms  358.49us  12.82ms   82.30%
    Req/Sec     1.38k    43.09     1.44k    80.00%
  Latency Distribution
     50%    5.72ms
     75%    5.91ms
     90%    6.15ms
     99%    6.95ms
  54821 requests in 10.00s, 29.64MB read
Requests/sec:   5479.66
Transfer/sec:      2.96MB